Documents/CRM_ЗаписьНаТестДрайв.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>CRM_ЗаписьНаТестДрайв</Name>
			<BasedOn>
				<xr:Item>Document.CRM_КоммерческоеПредложение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.CRM_ЗаписиНаТестДрайв</xr:Item>
				<xr:Item>InformationRegister.CRM_РезультатыКонтактов</xr:Item>
				<xr:Item>InformationRegister.CRM_ПроведенныйТестДрайв</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыдатьНапоминание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроведения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КилометражНаКонец</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КилометражНаНачало</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийРезультата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаршрутыТестДрайва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказОтАнкетирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательНапоминания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_СтатусыТестДрайва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТестДрайва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ТипыТестДрайвов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТопливоНаКонец</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТопливоНаНачало</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БУАвтомобиль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КодыКомментариев</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ПлановыеРезультатыКонтактов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CRM_ОценкаУдовлетворенностиКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/CRM_ТипыТестДрайвов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_ТипыТестДрайвов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/CRM_СтатусыТестДрайва.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_СтатусыТестДрайва</Name>
			<Comment>Состояния тест-драйва</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
					<Comment>Запланировано</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
					<Comment>Выполняется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
					<Comment>Завершено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
					<Comment>Отменено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершеноДосрочно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>Пользователи системы</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение компании, к которому относится пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация, к которой относится пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПрав</Name>
					<Comment>Права берутся от другого пользователя, указанного в этом реквизите</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимИспользованияОборудования</Name>
					<Comment>0 - обычный режим, 1 - локальное оборудование недоступно для других, 2 - запрещено любое использование оборудования</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяШаблоном</Name>
					<Comment>Является шаблоном</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>Содержит ссылку на график работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольККМ</Name>
					<Comment>пароль-идентификатор кассира при работе с КММ(ФР)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаФункциональнойПанели</Name>
					<Comment>Настройка функциональной панели</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиФункциональнойПанели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпТекущийВнутреннийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинСмит</Name>
					<Comment>Только Ниссан</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольСмит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Интерфейс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>90</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UsGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоменнаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольДоменнойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиАРМОтчеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НастройкиАРМОтчеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/CRM_ЗаписьНаТестДрайв/Forms/ФормаДокументаУпр1/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ЗаполнитьЗначенияСвойств(Объект,Параметры);
		Если НЕ ЗначениеЗаполнено(Объект.ДатаПроведения) Тогда
			Объект.ДатаПроведения = ТекущаяДата();
		КонецЕсли;		
		Объект.Организация = ПараметрыСеанса.Организация;
		//Организацию и подразделение - если не заполнены в пользователе - берем первые попавшиеся из справочника
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Организации.Ссылка
			|ИЗ
			|	Справочник.Организации КАК Организации
			|
			|УПОРЯДОЧИТЬ ПО
			|	Организации.Наименование";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Объект.Организация = Выборка.Ссылка;
			КонецЕсли;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В карточке пользователя не указана организация";
			Сообщение.Сообщить();
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПодразделенияКомпании.Ссылка
			|ИЗ
			|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПодразделенияКомпании.Наименование";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Объект.Организация = Выборка.Ссылка;
			КонецЕсли;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В карточке пользователя не указано подразделение";
			Сообщение.Сообщить();
		КонецЕсли;
		Объект.Маршрут = Справочники.CRM_МаршрутыТестДрайва.МаршрутПоУмолчанию;
		Объект.ТипТестДрайва = Перечисления.CRM_ТипыТестДрайвов.ЧастноеЛицо;
		Объект.ВыдатьНапоминание = Истина;
		ОпределитьПользователяНапоминания();
	КонецЕсли;  
	
	Если Объект.КодыКомментариев.Количество() > 0 Тогда
		Элементы.Анкета.Видимость = Ложь;
	КонецЕсли;
	
	спЗакладки.Добавить("Проведение");
	спЗакладки.Добавить("Результат");
	спЗакладки.Добавить("ДосрочноеЗавершение");
	спЗакладки[0].Пометка = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьПользователяНапоминания()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Менеджер", Объект.Менеджер);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пользователи.Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Сотрудник = &Менеджер
	|	И Пользователи.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.ПользовательНапоминания = Выборка.Ссылка;
	Иначе
		Объект.ПользовательНапоминания = Объект.Автор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОкруглитьВремяНачала();
		Объект.ВремяНапоминания = Объект.Начало - ВремяДоСобытия*3600;
	КонецЕсли;
	
	УправлениеЭлементами();
	
КонецПроцедуры

&НаКлиенте
Процедура ОкруглитьВремяНачала()
	
	МинутаНачала = Минута(Объект.Начало);
	ЧасНачала = Час(Объект.Начало);
	Если МинутаНачала <= 15 Тогда
		МинутаНачала = 0
	ИначеЕсли МинутаНачала <= 45 Тогда
		МинутаНачала = 30
	Иначе
		МинутаНачала = 60;
	КонецЕсли;
	Если ЧасНачала < 6 Тогда
		ЧасНачала = 6;
		МинутаНачала = 0;
	КонецЕсли;
	Объект.Начало = Дата(1,1,1) + ЧасНачала*3600 + МинутаНачала*60
	
КонецПроцедуры

&НаКлиенте
Функция ИмяТЧ() 
	Для Каждого Эл Из спЗакладки Цикл 
		Если Эл.Пометка Тогда 
			Возврат Эл.Значение 
		КонецЕсли 
	КонецЦикла 
КонецФункции	

&НаКлиенте
Процедура кнопкиТЧ(Команда)
	ИмяТЧ=ИмяТЧ();
	ИмяТЧОбъекта=?(ИмяТЧ="ЗаявкиНаКредит","РасчетКредита",ИмяТЧ);
	Если ТекущийЭлемент.Имя="кнДобавить" Тогда 
		СтрокаТЧ=Объект["Товары"].Добавить();
	ИначеЕсли ТекущийЭлемент.Имя="кнУдалить" Тогда 
		Если Элементы[ИмяТЧ].ТекущаяСтрока=Неопределено Тогда Возврат КонецЕсли;
		ТекСтрока=Объект[ИмяТЧОбъекта].НайтиПоИдентификатору(Элементы[ИмяТЧ].ТекущаяСтрока);
		Если ТекСтрока<>Неопределено Тогда Объект[ИмяТЧОбъекта].Удалить(ТекСтрока) КонецЕсли;
	ИначеЕсли ТекущийЭлемент.Имя="кнОбновить" Тогда Элементы[ИмяТЧ].Обновить()

	ИначеЕсли ТекущийЭлемент.Имя="кнОсновной" Тогда
		Если Элементы[ИмяТЧ].ТекущаяСтрока=Неопределено Тогда Возврат КонецЕсли;
		Для Каждого Стр Из Объект[ИмяТЧОбъекта] Цикл 
			Если Стр=Объект[ИмяТЧОбъекта].НайтиПоИдентификатору(Элементы[ИмяТЧ].ТекущаяСтрока) Тогда
				Стр.Основной=НЕ Стр.Основной
			Иначе
				Стр.Основной=Ложь
			КонецЕсли;	
		КонецЦикла;

	КонецЕсли;
	
	//УправлениеЭлементами(); 
	
КонецПроцедуры

&Насервере
Процедура ПолучитьСписокСтатусов(Статусы)
	Для Каждого Эл Из Перечисления.CRM_СтатусыТестДрайва Цикл 
		Статусы.Добавить(Эл) 
	КонецЦикла;	
КонецПроцедуры 

&НаКлиенте
Процедура кнСтатус(Команда)
	Если ТипЗнч(Команда) = Тип("КомандаФормы") Тогда
		Статусы = Новый СписокЗначений;
		ПолучитьСписокСтатусов(Статусы);	
		Статусы.НайтиПоЗначению(Объект.СтатусДокумента).Пометка = Истина;

		Парам = Новый Структура;
		Парам.Вставить("Список",Статусы);
		Парам.Вставить("Заголовок","Статусы записи на выдачу");
		Парам.Вставить("МножественныйВыбор",Ложь);
		Парам.Вставить("КоличествоЭлементовВСтроке",3);
		Парам.Вставить("ШиринаЭлемента",19);
		Парам.Вставить("ВысотаЭлемента",3);
		Статус = ОткрытьФормуМодально("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений",Парам,ЭтаФорма);
	КонецЕсли;
	
	Если Статус <> Неопределено Тогда 
		Объект.СтатусДокумента = Статус;
		Модифицированность = Истина;
	КонецЕсли;
	УправлениеЭлементами();
КонецПроцедуры

Процедура УправлениеЭлементами()
	
	Элементы.кнСтатус.Заголовок = "Статус:" + Символы.ПС + Объект.СтатусДокумента;
	
	//переключение закладки
	АктивныйЦвет = Новый Цвет(255,207,0);
	ПассивныйЦвет = Новый Цвет(189,195,206);
	Для Каждого Эл Из спЗакладки Цикл
		Элементы["кн"+Эл.Значение].ЦветФона = ?(Эл.Пометка,АктивныйЦвет,ПассивныйЦвет);
		Элементы["кн"+Эл.Значение].ЦветРамки = ?(Эл.Пометка,АктивныйЦвет,ПассивныйЦвет);
		Элементы[Эл.Значение].Видимость = Эл.Пометка;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура кнЗакладка(Команда)
	Для Каждого Эл Из спЗакладки Цикл 
		Эл.Пометка = Найти(ТекущийЭлемент.Имя, Эл.Значение) > 0 
	КонецЦикла; //пометка текущей закладки в списке
	УправлениеЭлементами();
КонецПроцедуры


&НаКлиенте
Процедура кнВыбратьМаршрут(Команда)
	ВвестиЗначение(Объект.Маршрут);
КонецПроцедуры


&НаКлиенте
Процедура кнАнкета(Команда)
	Форма = ПолучитьФорму("Документ.CRM_ЗаписьНаТестДрайв.Форма.ФормаАнкета", , ЭтаФорма);
	Если Форма.ОткрытьМодально() = Истина Тогда
		Если Форма.ОтказОтАнкетирования Тогда
			Объект.ОтказОтАнкетирования = Истина;
		Иначе
			Для Каждого Стр Из Форма.Анкета Цикл
				СтрРезультат = Объект.КодыКомментариев.Добавить();
				СтрРезультат.Показатель = Стр.Показатель;
				СтрРезультат.Оценка = Стр.Оценка;
				
				//Если Стр.Плохо ИЛИ Стр.Хорошо ИЛИ Стр.Отлично Тогда
				//	СтрРезультат = Объект.КодыКомментариев.Добавить();
				//	СтрРезультат.Показатель = Стр.Показатель;
				//	Если Стр.Плохо Тогда
				//		СтрРезультат.Результат = ПредопределенноеЗначение("Перечисление.CRM_ОценкаУдовлетворенностиКлиента.Плохо");
				//	ИначеЕсли Стр.Хорошо Тогда
				//		СтрРезультат.Результат = ПредопределенноеЗначение("Перечисление.CRM_ОценкаУдовлетворенностиКлиента.Хорошо");
				//	КонецЕсли;
				//КонецЕсли;
			КонецЦикла;
			Объект.КомментарийРезультата = Форма.Комментарий;
		КонецЕсли;
		Элементы.кнАнкета.Видимость = Ложь;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура НачалоПриИзменении(Элемент)
	ОпределитьВремяНапоминания();
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьВремяНапоминания()
	
	Объект.ВремяНапоминания = Объект.Начало - ВремяДоСобытия*3600;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Объект.Начало = Объект.Начало + Направление*1800;
	ОкруглитьВремяНачала();
	ОпределитьВремяНапоминания();
КонецПроцедуры


&НаКлиенте
Процедура ПользовательНапоминанияПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.ПользовательНапоминания) Тогда
		ОпределитьПользователяНапоминания();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ВремяНапоминанияПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.ВремяНапоминания) ИЛИ Объект.ВремяНапоминания > Объект.Начало Тогда
		ОпределитьВремяНапоминания();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ВыдатьНапоминаниеПриИзменении(Элемент)
	Элементы.ПользовательНапоминания.Доступность = Объект.ВыдатьНапоминание;
	Элементы.ВремяНапоминания.Доступность = Объект.ВыдатьНапоминание;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ДатаВыпуска = ПолучитьДатуВыпускаАвтомобиля(Объект.Автомобиль);
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить(КодВозвратаДиалога.Да,"Ознакомлен");
	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена,"Отмена");

	
	Если ДатаВыпуска < ДобавитьМесяц(ТекущаяДата(),-15)Тогда
		Ответ = Вопрос("Данный автомобиль произведен более 15 месяцев назад. "+Символы.ПС+"Такой автомобиль может быть продан только как уцененный, т.е. не отвечающий требованиям нового автомобиля и со сроком действия гарантии, указанной в системе ICM.  "+Символы.ПС+"При создании договора необходимо это учитывать, а так же ознакомиться с датой окончания гарантии в ICM.",СписокКнопок);			
		Если Ответ = КодВозвратаДиалога.Отмена Тогда
			Отказ = Истина;
		КонецЕсли;
	ИначеЕсли ДатаВыпуска < ДобавитьМесяц(ТекущаяДата(),-13) Тогда	
		Ответ = Вопрос("Данный автомобиль произведен более 14 месяцев назад.  "+Символы.ПС+"Такой автомобиль может быть продан только как уцененный, т.е. не отвечающий требованиям нового автомобиля и со сроком действия гарантии, указанной в системе ICM.  "+Символы.ПС+"При создании договора необходимо это учитывать, а так же ознакомиться с датой окончания гарантии в ICM.",СписокКнопок);
		Если Ответ = КодВозвратаДиалога.Отмена Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДатуВыпускаАвтомобиля(Автомобиль)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.VIN,
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.DATE_MADC
	|ИЗ
	|	РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
	|ГДЕ
	|	CRM_СостояниеАвтомобилейПроизводителя_v2.VIN = &VIN";
	
	Запрос.УстановитьПараметр("VIN",Автомобиль.VIN);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.DATE_MADC;	
	КонецЦикла;
	
	Возврат ТекущаяДата();
	
КонецФункции

&НаКлиенте
Процедура КлиентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОповещениеОВыбореКлиента = Новый ОписаниеОповещения("ПослеВыбораКлиентаЗавершение",ЭтаФорма);
	ОткрытьФорму("Документ.Renault_Договор.Форма.ФормаВыбораКлиентаУПР",,ЭтаФорма,,,,ОповещениеОВыбореКлиента);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКлиентаЗавершение(Результат, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Объект.Клиент = Результат.Клиент;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МенеджерПриИзменении(Элемент)
	ОпределитьПользователяНапоминания();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)	
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ДатаПроведения = Объект.ДатаПроведения + (Объект.Начало - Дата(1, 1, 1));	
		ДатаОкончания = ДатаПроведения + 60*Объект.Продолжительность;
		
		Парам = Новый Структура;
		Парам.Вставить("Дата",ДатаПроведения);
		Парам.Вставить("ДатаЗакрытия",ДатаОкончания);
		Парам.Вставить("Длительность",Объект.Продолжительность);
		//Закрыть(Парам);
		Оповестить("ВыборСвязанногоДокумента", Парам, ВладелецФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтомобильНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Если Не ЗначениеЗаполнено(Объект.Продолжительность) Тогда
		Сообщить("Укажите продолжительность тест-драйва");
		Возврат;
	КонецЕсли;
	
	ФормаСписка = ПолучитьФорму("Обработка.Renault_ARM_Администратор.Форма.ФормаВыбораИзСпискаПлиткой");

	Если Не Объект.БУАвтомобиль Тогда
		Список = Renault_CRM.ПолучитьСписокАвтоДляТестДрайва(Объект.ДилерскийЦентр);
		// проверка на занятость
		ПроверитьДоступностьАвтомобиляДляТестДрайва(Список, Объект.ДатаПроведения, Объект.Продолжительность);
		ФормаСписка.Заголовок = "Выбор автомобиля для тест-драйва";
	Иначе
		ТаблицаАвтомобилей = Renault_CRM.ПолучитьСписокБУАвтоДляТестДрайва(Объект.ДилерскийЦентр);
		Список = Новый СписокЗначений;
		Список.ЗагрузитьЗначения(ТаблицаАвтомобилей.ВыгрузитьКолонку("Автомобиль")); 
		ФормаСписка.Заголовок = "Выбор автомобиля с пробегом для тест-драйва";
	КонецЕсли;
	
	ФормаСписка.Список = Список;
	Ответ = ФормаСписка.ОткрытьМодально();

	Если ЗначениеЗаполнено(Ответ) Тогда
		Объект.Автомобиль = Ответ;
	КонецЕсли;

	//АвтомобильНачалоВыбораНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьДоступностьАвтомобиляДляТестДрайва(СписокАвтомобилей, ДатаПроведения, Длительность)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаПроведения", НачалоДня(ДатаПроведения));
	Начало = Дата(1, 1, 1, Час(ДатаПроведения), Минута(ДатаПроведения), 0) ;
	Запрос.УстановитьПараметр("Начало", Начало);
	Запрос.УстановитьПараметр("Конец", Начало + (Длительность-1)*60);
	Запрос.УстановитьПараметр("СписокАвтомобилей", СписокАвтомобилей);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаписьНаТестДрайв.Автомобиль,
	|	Представление(ЗаписьНаТестДрайв.Автомобиль) КАК АвтомобильПредставление,
	|	Представление(ЗаписьНаТестДрайв.Менеджер) КАК МенеджерПредставление
	|ИЗ
	|	Документ.CRM_ЗаписьНаТестДрайв КАК ЗаписьНаТестДрайв
	|ГДЕ
	|	ЗаписьНаТестДрайв.ДатаПроведения = &ДатаПроведения
	|	И (ЗаписьНаТестДрайв.Начало МЕЖДУ &Начало И &Конец
	|			ИЛИ ДОБАВИТЬКДАТЕ(ЗаписьНаТестДрайв.Начало, МИНУТА, ЗаписьНаТестДрайв.Продолжительность - 1) МЕЖДУ &Начало И &Конец
	|			ИЛИ &Начало МЕЖДУ ЗаписьНаТестДрайв.Начало И ДОБАВИТЬКДАТЕ(ЗаписьНаТестДрайв.Начало, МИНУТА, ЗаписьНаТестДрайв.Продолжительность - 1)
	|			ИЛИ &Конец МЕЖДУ ЗаписьНаТестДрайв.Начало И ДОБАВИТЬКДАТЕ(ЗаписьНаТестДрайв.Начало, МИНУТА, ЗаписьНаТестДрайв.Продолжительность - 1))
	|	И ЗаписьНаТестДрайв.Автомобиль В (&СписокАвтомобилей)
	|	И ЗаписьНаТестДрайв.ПометкаУдаления = ЛОЖЬ
	|	И НЕ ЗаписьНаТестДрайв.СтатусДокумента = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыТестДрайва.Отменено)";
	РезультатЗапроса = Запрос.Выполнить();
		
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекЭлемент = СписокАвтомобилей.НайтиПоЗначению(Выборка.Автомобиль);
		МенеджерФамилия = Сред(Выборка.МенеджерПредставление, 1, Найти(Выборка.МенеджерПредставление, " "));
		ТекЭлемент.Представление = Выборка.АвтомобильПредставление + " занят " + МенеджерФамилия;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	//Вставить содержимое обработчика
КонецПроцедуры
